tmux
fd
fzf
bat
xclip
go
go-tools
yay
sxhkd
vifm
python-ueberzug
htop
gopass
zathura
zathura-pdf-mupdf
newsboat
light-locker
sxiv
figlet
conky-manager
youtube-dl
the_silver_searcher
docker
