# vim: syntax=ruby filetype=ruby

tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "caskroom/cask"

brew "asciinema"
brew "ansible"
brew "bash-completion"
brew "cmus"
brew "csvkit"
brew "curl"
brew "dict"
brew "docker-completion"
brew "fd"
brew "ffmpeg"
brew "fpp"
brew "fzf"
brew "gnupg"
brew "go"
brew "gopass"
brew "highlight"
brew "htop", args: ["with-ncurses"] 
brew "httpie"
brew "jq"
brew "jump"
brew "gron"
brew "kubernetes-cli"
brew "neomutt"
brew "newsboat"
brew "ncurses"
brew "offlineimap"
brew "dialog"
brew "nmap"
brew "p7zip"
brew "packer"
brew "packer-completion"
brew "pinentry-mac"
brew "pup"
brew "ranger"
brew "reattach-to-user-namespace"
brew "stow"
brew "tree"
brew "tmux"
brew "vagrant-completion"
brew "watch"
brew "w3m"
brew "wget"
brew "youtube-dl"
brew "zsh"
brew "go-jira"
cask "adobe-acrobat-reader"
cask "atom"
cask "caffeine"
cask "docker"
cask "goland"
cask "google-chrome"
cask "iterm2"
cask "java-jdk-javadoc"
cask "jxplorer"
cask "karabiner"
cask "karabiner-elements"
cask "minikube"
cask "mpv"
cask "qbittorrent"
cask "skype"
cask "slack"
cask "sublime-text"
cask "vagrant"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio-code"
cask "vlc"
cask "vmware-fusion"
cask "wireshark"
cask "caskroom/fonts/font-inconsolata"
cask "caskroom/fonts/font-fira-code"
cask "font-hack-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-meslo-nerd-font"
